20MB/test4-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   231.575 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.13 [#/sec] (mean)
Time per request:       7719.166 [ms] (mean)
Time per request:       7719.166 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3418.08 kb/s sent
                        3418.12 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:  6154 7719 1178.0   7399   11103
Waiting:     4787 6232 1100.7   6001    9597
Total:       6155 7719 1178.0   7399   11103

Percentage of the requests served within a certain time (ms)
  50%   7399
  66%   8236
  75%   8481
  80%   8755
  90%   9386
  95%   9829
  98%  11103
  99%  11103
 100%  11103 (longest request)