20MB/test4-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        22088 bytes

Concurrency Level:      1
Time taken for tests:   198.279 seconds
Complete requests:      30
Failed requests:        0
Non-2xx responses:      30
Total transferred:      668400 bytes
Total body sent:        600005430
HTML transferred:       662640 bytes
Requests per second:    0.15 [#/sec] (mean)
Time per request:       6609.305 [ms] (mean)
Time per request:       6609.305 [ms] (mean, across all concurrent requests)
Transfer rate:          3.29 [Kbytes/sec] received
                        2955.14 kb/s sent
                        2958.43 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   11   6.2     10      25
Processing:  3423 6597 3297.6   5069   16409
Waiting:       70  466 292.3    535    1124
Total:       3433 6609 3297.8   5079   16421

Percentage of the requests served within a certain time (ms)
  50%   5079
  66%   7834
  75%   8998
  80%   9815
  90%  11366
  95%  12342
  98%  16421
  99%  16421
 100%  16421 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient)...

Server Software:        
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   1.378 seconds
Complete requests:      0
Failed requests:        0
Total transferred:      0 bytes
Total body sent:        18832320
HTML transferred:       0 bytes
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        88 bytes

Concurrency Level:      1
Time taken for tests:   0.529 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      6990 bytes
Total body sent:        13440
HTML transferred:       2640 bytes
Requests per second:    56.75 [#/sec] (mean)
Time per request:       17.621 [ms] (mean)
Time per request:       17.621 [ms] (mean, across all concurrent requests)
Transfer rate:          12.91 [Kbytes/sec] received
                        24.83 kb/s sent
                        37.74 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    16   17   1.8     17      23
Waiting:       15   17   1.8     17      23
Total:         16   18   1.8     17      23

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     17
  75%     18
  80%     18
  90%     21
  95%     22
  98%     23
  99%     23
 100%     23 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   240.036 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.12 [#/sec] (mean)
Time per request:       8001.205 [ms] (mean)
Time per request:       8001.205 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3297.60 kb/s sent
                        3297.63 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:  6080 8001 1428.0   7833   12089
Waiting:     4528 6480 1411.8   6293   10429
Total:       6080 8001 1428.1   7833   12090

Percentage of the requests served within a certain time (ms)
  50%   7833
  66%   8205
  75%   8859
  80%   9270
  90%  10145
  95%  10383
  98%  12090
  99%  12090
 100%  12090 (longest request)