20MB/test4-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        22088 bytes

Concurrency Level:      1
Time taken for tests:   198.279 seconds
Complete requests:      30
Failed requests:        0
Non-2xx responses:      30
Total transferred:      668400 bytes
Total body sent:        600005430
HTML transferred:       662640 bytes
Requests per second:    0.15 [#/sec] (mean)
Time per request:       6609.305 [ms] (mean)
Time per request:       6609.305 [ms] (mean, across all concurrent requests)
Transfer rate:          3.29 [Kbytes/sec] received
                        2955.14 kb/s sent
                        2958.43 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   11   6.2     10      25
Processing:  3423 6597 3297.6   5069   16409
Waiting:       70  466 292.3    535    1124
Total:       3433 6609 3297.8   5079   16421

Percentage of the requests served within a certain time (ms)
  50%   5079
  66%   7834
  75%   8998
  80%   9815
  90%  11366
  95%  12342
  98%  16421
  99%  16421
 100%  16421 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient)...

Server Software:        
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   1.378 seconds
Complete requests:      0
Failed requests:        0
Total transferred:      0 bytes
Total body sent:        18832320
HTML transferred:       0 bytes