20MB/test4-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   233.660 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.13 [#/sec] (mean)
Time per request:       7788.669 [ms] (mean)
Time per request:       7788.669 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3387.58 kb/s sent
                        3387.61 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       4
Processing:  5983 7788 1109.8   7765    9703
Waiting:     4536 6269 1088.1   6035    8120
Total:       5984 7789 1109.9   7765    9703

Percentage of the requests served within a certain time (ms)
  50%   7765
  66%   8347
  75%   8845
  80%   9108
  90%   9222
  95%   9467
  98%   9703
  99%   9703
 100%   9703 (longest request)