20MB/test4-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   265.259 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.11 [#/sec] (mean)
Time per request:       8841.964 [ms] (mean)
Time per request:       8841.964 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        2984.04 kb/s sent
                        2984.07 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  6331 8842 1792.5   8412   12877
Waiting:     4960 7305 1748.8   6960   11379
Total:       6331 8842 1792.5   8412   12877

Percentage of the requests served within a certain time (ms)
  50%   8412
  66%   9305
  75%  10247
  80%  10467
  90%  12527
  95%  12622
  98%  12877
  99%  12877
 100%  12877 (longest request)