20MB/test5-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload2
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   263.582 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810540000
HTML transferred:       2850 bytes
Requests per second:    0.11 [#/sec] (mean)
Time per request:       8786.066 [ms] (mean)
Time per request:       8786.066 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3003.02 kb/s sent
                        3003.05 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:  6413 8786 2459.9   7854   18159
Waiting:     5018 7238 2323.0   6487   15929
Total:       6413 8786 2459.9   7854   18160

Percentage of the requests served within a certain time (ms)
  50%   7854
  66%   8900
  75%   9542
  80%  10133
  90%  11854
  95%  13472
  98%  18160
  99%  18160
 100%  18160 (longest request)