20MB/test5-Origin.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        22088 bytes

Concurrency Level:      1
Time taken for tests:   83.028 seconds
Complete requests:      30
Failed requests:        0
Non-2xx responses:      30
Total transferred:      668400 bytes
Total body sent:        600005430
HTML transferred:       662640 bytes
Requests per second:    0.36 [#/sec] (mean)
Time per request:       2767.609 [ms] (mean)
Time per request:       2767.609 [ms] (mean, across all concurrent requests)
Transfer rate:          7.86 [Kbytes/sec] received
                        7057.15 kb/s sent
                        7065.01 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4    8   6.1      5      28
Processing:  1601 2760 1060.2   2559    5822
Waiting:       58  302 211.6    256     792
Total:       1607 2768 1062.1   2565    5827

Percentage of the requests served within a certain time (ms)
  50%   2565
  66%   2865
  75%   3819
  80%   3883
  90%   4079
  95%   4310
  98%   5827
  99%   5827
 100%   5827 (longest request)