20MB/test5-Split.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking t22.tfcis.org (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        t22.tfcis.org
Server Port:            10022

Document Path:          /file/upload
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   254.946 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      7200 bytes
Total body sent:        810539970
HTML transferred:       2850 bytes
Requests per second:    0.12 [#/sec] (mean)
Time per request:       8498.210 [ms] (mean)
Time per request:       8498.210 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received
                        3104.74 kb/s sent
                        3104.77 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:  6526 8498 1742.0   7840   14065
Waiting:     4993 6917 1631.2   6224   11985
Total:       6526 8498 1742.0   7840   14065

Percentage of the requests served within a certain time (ms)
  50%   7840
  66%   8389
  75%   8887
  80%   9921
  90%  11258
  95%  12109
  98%  14065
  99%  14065
 100%  14065 (longest request)